Revit 2027 API
AssetPropertyDistance.GetUnitTypeId Method
 Gets the identifier of the unit quantifying the distance property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetUnitTypeId()
Public Function GetUnitTypeId As ForgeTypeId
public:
ForgeTypeId^ GetUnitTypeId()
member GetUnitTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace